#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tadyjp/home-IoT/runs/run-m4GAMp4kYAzyvEYC

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_role.nature_remo_to_dynamo: Refreshing state... [id=nature-remo-to-dynamo]
aws_cloudwatch_log_group.nature_remo_to_dynamo: Refreshing state... [id=/aws/lambda/nature_remo_to_dynamo]
aws_kinesis_stream.soracom_button: Refreshing state... [id=arn:aws:kinesis:ap-northeast-1:188529565947:stream/soracom-button]
aws_iam_role.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution]
aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/soracom_button_to_slack]
aws_dynamodb_table.nature_remo_sensor: Refreshing state... [id=nature-remo-sensor]
aws_iam_role_policy_attachment.lambda_kinesis_execution: Refreshing state... [id=lambda-kinesis-execution-20220318035103012700000001]
aws_lambda_function.soracom_button_to_slack: Refreshing state... [id=soracom_button_to_slack]
aws_lambda_event_source_mapping.soracom_button_lambda: Refreshing state... [id=ec065c36-7c11-44b2-a922-c35a6664679f]
aws_lambda_function.nature_remo_to_dynamo: Refreshing state... [id=nature_remo_to_dynamo]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.nature_remo_sensor has changed
  ~ resource "aws_dynamodb_table" "nature_remo_sensor" {
        id             = "nature-remo-sensor"
        name           = "nature-remo-sensor"
      + tags           = {}
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_lambda_event_source_mapping.soracom_button_lambda has changed
  ~ resource "aws_lambda_event_source_mapping" "soracom_button_lambda" {
        id                                 = "ec065c36-7c11-44b2-a922-c35a6664679f"
      ~ last_modified                      = "2022-04-23T14:14:00Z" -> "2022-04-23T14:24:00Z"
      ~ last_processing_result             = "PROBLEM: Function call failed" -> "OK"
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.nature_remo_to_dynamo will be created
  + resource "aws_cloudwatch_event_rule" "nature_remo_to_dynamo" {
      + arn                 = (known after apply)
      + description         = "Run nature_remo_to_dynamo every minutes"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "nature_remo_to_dynamo_every_minutes"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(* * * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.output_report_every_month will be created
  + resource "aws_cloudwatch_event_target" "output_report_every_month" {
      + arn            = "arn:aws:lambda:ap-northeast-1:188529565947:function:nature_remo_to_dynamo"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "nature_remo_to_dynamo_every_minutes"
      + target_id      = "nature_remo_to_dynamo"
    }

  # aws_cloudwatch_log_group.lambda_log_group will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda_log_group" {
        id                = "/aws/lambda/soracom_button_to_slack"
        name              = "/aws/lambda/soracom_button_to_slack"
      ~ retention_in_days = 0 -> 14
        tags              = {}
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.nature_remo_to_dynamo will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "nature_remo_to_dynamo" {
        id                = "/aws/lambda/nature_remo_to_dynamo"
        name              = "/aws/lambda/nature_remo_to_dynamo"
      ~ retention_in_days = 0 -> 14
        tags              = {}
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.nature_remo_to_dynamo will be updated in-place
  ~ resource "aws_lambda_function" "nature_remo_to_dynamo" {
      + code_signing_config_arn        = ""
      + description                    = ""
        id                             = "nature_remo_to_dynamo"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      ~ last_modified                  = "2022-04-23T14:23:40.000+0000" -> (known after apply)
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
      ~ source_code_hash               = "dVk+SJvkem1SXjQI5H2DWNH0MEAiIQS+pk5FAGFBJ9I=" -> "wm5+zpooXGbgGkLmTidtmb3ZAEG3BAhDg+7940Q5wAY="
        tags                           = {}
        # (18 unchanged attributes hidden)

      + environment {
          + variables = {
              + "NATURE_API_TOKEN" = (sensitive)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.nature_remo_to_dynamo will be created
  + resource "aws_lambda_permission" "nature_remo_to_dynamo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "nature_remo_to_dynamo"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 3 to add, 3 to change, 0 to destroy.


```
</details>
*Pusher: @tadyjp, Action: `pull_request`*